Public Attributes | List of all members
API_AttributeFolder Struct Reference
Attribute Management
An attribute folder. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 API_AttrTypeID  | typeID
Type of the attribute folder; this identifies the folder along with the path or guid field.
 GS::Array< GS::UniString >  | path
Path of the folder, list of the names of the parent folders and the current in order.
 GS::Guid  | guid
The globally unique identifier (GUID) of the folder; can be used for identifying the folder with ACAPI_Attribute_GetFolder.
Detailed Description
An attribute folder.
Since
Archicad 26
Remarks
The name of the folder is not used.